name: Entra ID High or Medium Risk Sign-in Outside US
language: sigma
id: entra_high_medium_risk_signin_outside_us
description: High/Medium risk Entra ID sign-ins where the source country is not US.
severity: high
enabled: true

logsource:
  product: azure
  service: signinlogs

index:
  - logs-azure.signinlogs*

detection:
  selection:
    azure.signinlogs.properties.risk_level_aggregated:
      - medium
      - high
  filter_geo:
    source.geo.country_iso_code: US
  condition: selection and not filter_geo
